Repository: RooieDirk/pypilot_pi
Catalog: po/*.po
Languages: es_es, fi_fi, fr_fr

source: Press the level button when the boat is sitting level in the water to align the inertial sensors used by the autopilot. This alignment is critical for the autopilot to work correctly, and also for the compass to calibrate automatically.
es_es: Pulse el botón nivel cuando el barco esté completamente nivelado en el agua para alinear los sensores inerciales utilizados por el piloto automático. Esta alineación es crucial para que el piloto automático funcione correctamente y también para que funcione la calibración automática del compás.
fi_fi: Paina taso-painiketta, kun veneen kelluu vedessä, jotta autopilotin käyttämät asentoanturit voivat toimia. Tämä yhdenmukaistaminen on kriittinen, että autopilotti toimii oikein ja kompassi saadaan kalibroitua automaattisesti.
fr_fr: Appuyez sur le bouton de niveau, lorsque le bateau est à niveau dans l’eau, pour aligner les capteurs inertiels utilisés par le pilote automatique. Cet alignement est essentiel pour que le pilote automatique fonctionne correctement, et pour que le compas se calibre automatiquement.

source: You may manually adjust the alignment of the compass. The autopilot may work without the correct alignment, but the reported headings will not be correct. The autopilot may also work better depending on control algorithm if the heading is correctly aligned.
es_es: Puede ajustar manualmente la alineación del compás. El piloto puede funcionar sin una compensación adecuada pero los rumbos mostrados no serán correctos. El algoritmo de control del piloto trabajará mejor si el rumbo es compensado con precisión.
fi_fi: Kompassi linjausta voidaan muuttaa manuaalisesti. Autopilotti voi toimia ilman oikea linjausta, mutta raportoitud suunnat eivät näy oikein. Autopilotti voi myös toimia paremmin riippuen hallita algoritmista, jos suunta on korjattu oikein.
fr_fr: Vous pouvez régler manuellement l'alignement du compas. Le pilote automatique peut fonctionner sans l'alignement correct, mais les caps signalés ne seront pas corrects. Le pilote automatique peut également mieux fonctionner selon l'algorithme de contrôle si le cap est correctement aligné.

source: To calibrate rudder feedback: 1) set 'Range' to a known angle 2) manually center the rudder and press 'Centered'. 3) manually turn rudder to starboard this angle and press 'Starboard Range' 4) manually turn rudder to port this angle and press 'Port Range'5) set 'Range' to the maximum allowed autopilot movement
es_es: Para calibrar las respuestas del timón: 1) establezca 'Rango' en un ángulo conocido 2) centre manualmente el timón y presione 'Centrado'. 3) gire manualmente el timón para estribor este ángulo y presione 'Rango de Estribor' 4) gire manualmente el timón para babor este ángulo y presione 'Rango de Babor' 5) establezca 'Rango' al máximo permitido del piloto automático
fi_fi: Kalibroitaksesi peräsimen palautetta: 1) aseta 'Etäisyys' tunnettuun kulmaan 2) keskitä peräsin käsin ja paina 'Keskitetty'. 3) Käännä peräsin käsin oikealle perille ja paina 'Oikea alue' 4) käännä peräsin käsin vasemmalle perille ja paina 'Vasen alue'5) aseta 'Alue' suurimpaan sallittuun automaattiohjauksen liikkeeseen
fr_fr: Pour calibrer les retour de donnée du gouvernail : 1) Définissez 'Plage' pour un angle 2) Dentrez manuellement le gouvernail et appuyez sur 'Centrer'. 3) Tournez manuellement le gouvernail à tribord de cet angle et appuyez sur 'Portée tribord' 4) Tournez manuellement le gouvernail sur babord et appuyez sur 'Portée babord' 5) Définir 'Plage' le maximum autorisé du mouvement du pilote automatique

source: You may wish to lock the calibration against automatically updating
es_es: Puede desear bloquear la calibración para que no haya actualización automática
fi_fi: Voit halutessasi lukita kalibroinnin automaattisen päivityksen
fr_fr: Vous pouvez verrouiller le calibrage pour empêcher la mise à jour automatique

source: Make the buttons for tacking visible.
es_es: Hacer visibles los botones de virada.
fi_fi: Aseta luovipainikkeet tarvittaessa näkyviksi.
fr_fr: Rendre visibles les boutons pour le virement de bord

source: Always ask tacking direction even if the autopilot can determine it.
es_es: Preguntar siempre la dirección de virada incluso si el piloto automático pueda determinarlo.
fi_fi: Kysy aina luovisuunta, vaikka autopilotti pystyisi määrittämään sen.
fr_fr: Toujours demander la direction du changement de bord même si le pilote automatique peut le déterminer.

source: Still show the tacking direction dialog even if a wind sensor is used.
es_es: Muestre el diálogo de dirección de giro incluso si se utiliza un sensor de viento.
fi_fi: Näytä vielä luovisuunnan valintaikkuna, vaikka tuuliviiri olisi käytössä.
fr_fr: Toujours afficher la boîte de dialogue de direction du changement de bord même si un capteur de vent est utilisé.

source: Plugin automatically sends and receives nmea data between opencpn and pypilot. The plugin communicates directly to pypilot, but nmea0183 is needed by other opencpn plugins and for route following. Eliminates the need to make the tcp connection in opencpn connection settings. If you need specific nmea filtering you should disable this, and instead make a tcp connection to the pypilot host tcp port 20220 in the opencpn connections settings.
es_es: El Plugin envía y recibe automáticamente datos nmea entre opencpn y pypilot. El plugin comunica directamente con pypilot, pero nmea0183 es necesario por otros plugins y para seguir una ruta. Elimina la necesidad de hacer conexión tcp en ajustes conexión opencpn. Si necesita hacer un filtrado nmea especifico debe deshabilitar esto, y en vez hacer una conexión tcp al host pypilot en puerto 20220 en los ajustes de conexión opencpn.
fi_fi: Plugin automaattisesti lähettää ja vastaanottaa nmea tietojen välillä opencpn ja pypilot. plugin kommunikoi suoraan pypilot, mutta nmea0183 tarvitaan muiden opencpn plugins ja reitin jälkeen. Poistaa tarpeen tehdä tcp yhteys opencpn:n yhteydet asetuksissa. Jos tarvitset tietyn nmea-suodatuksen, sinun pitää estää tämä, ja sen sijaan tehdä tcp yhteys pypilot isänän tcp porttiin 20220 opencpn:n yhteydet asetuksissa.
fr_fr: Le plugin envoie et reçoit automatiquement des données NMEA entre OpenCPN et Pypilot. Le plugin communique directement avec pypilot, mais nmea0183 est nécessaire aux autres plugins OpenCPN et pour le suivi d'itinéraire. Élimine le besoin d'établir la connexion TCP dans les paramètres de connexion OpenCPN. Si vous avez besoin d'un filtrage NMEA spécifique, vous devez le désactiver et établir à la place une connexion TCP au port TCP 20220 de l'hôte pypilot dans les paramètres de connexions OpenCPN.

source: Displays lines on the chart showing the autopilot's configured headings
es_es: Muestra lineas en la carta para ver los rumbos configurados en el piloto
fi_fi: Näyttää linjat kartalla autopilotin muodostamien suuntien mukaan
fr_fr: Afficher les lignes sur la zone de carte montrant les caps configurés du pilote automatique

source: Converts displayed headings to true north rather than magnetic north. This affects compass mode only, and requires the wmm plugin to be active. The conversion is applied only within the plugin, the autopilot is commanded in the corrected magnetic heading.
es_es: Convierte los rumbos mostrados en verdaderos en vez de magnéticos. Esto afecta solo al modo compás y requiere que el plugin wmm esté activado. La conversión se aplica solo en el plugin, al piloto automático se envía la orden de rumbo magnético correcto.
fi_fi: Muuntaa näytetyt suunnat mieluummin tosipohjoiseen kuin magneettiseen pohjoiseen. Tämä vaikuttaa vain kompassin tilaan ja vaatii wmm pluginia aktiiviseksi. Muuntaminen tehdään vain pluginissa, autopilottia ohjataan korjattuun magneettiseen suuntaan.
fr_fr: Convertit les caps affichés en nord vrai plutôt qu'en nord magnétique. Cela n'affecte que le mode compas et nécessite que le complément WMM soit actif. La conversion est appliquée uniquement dans le complément, le pilote automatique est commandé dans le cap magnétique correct.

source: Automatically switch pypilot to NAV mode whenever a route is active
es_es: Cambia automáticamente el pypilot al modo NAV cuando una ruta está activa
fi_fi: Vaihda pypilot automaattisesti NAV-tilaan aina, kun reitti on aktiivinen
fr_fr: Basculer automatiquement le Pypilot en mode NAV chaque fois qu'une route est active

source: Adjust the speed of manual control
es_es: Ajustar la velocidad del control manual
fi_fi: Säädä manuaalisen ohjauksen nopeutta
fr_fr: Ajuster la vitesse du contrôle manuel

source: Add New Profile
es_es: Añadir nuevo perfil
fi_fi: Lisää uusi profiili
fr_fr: Ajouter nouveau Profil

source: Profile
es_es: Perfil
fi_fi: Profiili
fr_fr: Profil

source: Remove Current Profile?
es_es: ¿Eliminar perfil actual?
fi_fi: Poistetaanko Nykyinen Profiili?
fr_fr: Supprimer le profil actuel

source: Tack
es_es: Virada
fi_fi: Luovi
fr_fr: Virements

source: Cancel
es_es: Cancelar
fi_fi: Peruuta
fr_fr: Annuler

source: No Motor Controller
es_es: Sin controlador de motor
fi_fi: Ei Moottorinohjainta
fr_fr: Aucun contrôleur de moteur

source: True North mode not possible without declination. Is the wmm plugin enabled and a gps fix available?
es_es: El modo N verdadero no es posible sin declinación magnética. ¿están el plugin wmm activado y hay una posición de gps disponibles?
fi_fi: Tosi Pohjoinen tila ei ole mahdollista ilman erantoa. Onko wmm plugin käytössä ja gps-yhteys saatavilla?
fr_fr: Le mode "Nord vrai" n'est pas possible sans déclinaison. Le plugin WMM est-il activé et un gps ayant fait son "fix" est-il opérationnel ?

source: AP
es_es: PA

source: compass
es_es: compás
fi_fi: kompassi
fr_fr: compas

source: wind
es_es: viento
fi_fi: tuuli
fr_fr: vent

source: tack
es_es: virada
fi_fi: luovi
fr_fr: virement

source: Config
es_es: Configuración
fi_fi: Kokoonpano
fr_fr: Configuration

source: Gains
es_es: Ganancia
fi_fi: Vahvistukset

source: Calibration
es_es: Calibración
fi_fi: Kalibrointi
fr_fr: Étalonnage

source: Settings
es_es: Ajustes
fi_fi: Asetukset
fr_fr: Paramètres

source: Stats
es_es: Estadísticas
fi_fi: Tilastot
fr_fr: Statistiques

source: << Port Tack
es_es: << Virada a Bobor
fi_fi: << Vasen luovi
fr_fr: << Virement babord

source: Starboard Tack >>
es_es: Virada a Estribor >>
fi_fi: Oikea luovi >>
fr_fr: Virement tribord >>

source: Add
es_es: Añadir
fi_fi: Lisää
fr_fr: Ajouter

source: Remove
es_es: Eliminar
fi_fi: Poista
fr_fr: Retirer

source: Pilot
es_es: Piloto
fi_fi: Pilotti
fr_fr: Pilote

source: Auto Discover
es_es: Auto-Descubrir
fi_fi: Automaattinen Löydä
fr_fr: Découverte automatique

source: Plugin Settings
es_es: Ajustes del Plugin
fi_fi: Liitännäisen Asetukset
fr_fr: Paramètres du plugin

source: Tacking Button
es_es: Botón de Virada
fi_fi: Luovi Painike
fr_fr: Bouton enclanchement du virement

source: Always Confirm Tacking Direction
es_es: Confirmar siempre la dirección de Virado
fi_fi: Vahvista Aina Luovin Suunta
fr_fr: Toujours confirmer la direction de virement

source: Center Button
es_es: Botón central
fi_fi: Keskipainike
fr_fr: Bouton central

source: Forward NMEA
es_es: Reenviar NMEA
fi_fi: Välitä NMEA
fr_fr: Transférer NMEA

source: Enable Graphical Overlay
es_es: Activar la superposición gráfica
fi_fi: Salli graafinen peitto
fr_fr: Permettre la superposition graphique

source: True North Mode
es_es: Modo norte verdadero
fi_fi: Tosipohjoisen tila
fr_fr: Mode Nord vrai

source: Switch to NAV Mode
es_es: Cambiar al modo NAV
fi_fi: Vaihda NAV-tilaan
fr_fr: Passer en mode NAV

source: Manual Control Speed
es_es: Velocidad de control manual
fi_fi: Manuaalinen Ohjausnopeus
fr_fr: Vitesse de contrôle manuelle

source: Angle Buttons
es_es: Botones de Ángulo
fi_fi: Kulma Painikkeet
fr_fr: Boutons d'angle

source: Columns
es_es: Columnas
fi_fi: Sarakkeet
fr_fr: Colonnes

source: Information
es_es: Información
fi_fi: Tiedot

source: pypilot Version
es_es: Versión de pypilot
fi_fi: pypilot versio
fr_fr: version pypilot

source: Uptime
es_es: Tiempo de funcionamiento
fi_fi: Toiminta-aika
fr_fr: Temps d'activité

source: Runtime
es_es: Tiempo en marcha
fi_fi: Ajonaika
fr_fr: Durée d'exécution

source: Average Power Consumption
es_es: Promedio de Consumo eléctrico
fi_fi: Keskimääräinen virrankulutus
fr_fr: Consommation d'énergie moyenne

source: Watts
es_es: Vatios
fi_fi: Wattia

source: Total amp hours
es_es: Total amp/hora
fi_fi: Kokonais Ah: t
fr_fr: Nombre total d’heures

source: Reset
es_es: Reiniciar
fi_fi: Palauta
fr_fr: RàZ

source: Voltage
es_es: Voltaje
fi_fi: Jännite

source: Controller Temperature
es_es: Temperatura del controlador
fi_fi: Ohjain lämpötila
fr_fr: Contrôleur de température

source: Motor Temperature
es_es: Temperatura del motor
fi_fi: Mottorin lämpötila
fr_fr: Température du moteur

source: pypilot Client
es_es: Cliente pypilot
fr_fr: Client Pypilote

source: Accel
es_es: Acel
fi_fi: Kiihtyvyys

source: Age
es_es: Antigüedad
fi_fi: Ikä
fr_fr: Acienneté

source: Calibration Locked
es_es: Calibración bloqueada
fi_fi: Kalibrointi Lukittu
fr_fr: Étalonnage verrouillé

source: Accelerometers
es_es: Acelerómetros
fi_fi: Kiihtyvyysanturit
fr_fr: Accéléromètres

source: Compass
es_es: Compás
fi_fi: Kompassi
fr_fr: Compas

source: Alignment
es_es: Alineación
fi_fi: Sijoittelu
fr_fr: Alignement

source: Pitch / Roll
es_es: Cabeceo / Balance
fi_fi: Pit./Siv. kallist
fr_fr: Pitch/Roulette

source: Level
es_es: Nivel
fi_fi: Taso
fr_fr: Niveau

source: Heading Offset
es_es: Corrección de rumbo
fi_fi: Suunta siirtymä
fr_fr: Décalage de cap

source: Rudder
es_es: Timón
fi_fi: Peräsin
fr_fr: gouvernail

source: Angle
es_es: Ángulo
fi_fi: Kulma

source: Offset
es_es: Desfase
fi_fi: Siirtymä
fr_fr: Décalage

source: Scale
es_es: Escala
fi_fi: Mittakaava
fr_fr: Echelle

source: Non Linearity
es_es: Sin Linealidad
fi_fi: Ei lineaarinen
fr_fr: Non linéaire

source: Centered
es_es: Centrado
fi_fi: Keskitetty
fr_fr: Centré

source: Reset Calibration
es_es: Restablecer Calibración
fi_fi: Nollaa Kalibrointi
fr_fr: Raz Calibration

source: Starboard Range
es_es: Alcance Estribor
fi_fi: Oikea alue
fr_fr: Rayon tribord

source: Port Range
es_es: Alcance a Babor
fi_fi: Vasen Alue
fr_fr: Rayon babord

source: Range
es_es: Rango
fi_fi: Alue
fr_fr: Rayon

source: pypilot Gains
es_es: Ganancias de pypilot
fi_fi: pypilot ohjaukset
fr_fr: Gains de Pilote

source: pypilot Configuration
es_es: Configuración de pypilot
fi_fi: pypilot Konfiguraatio
fr_fr: configuration de Pypilot

source: pypilot Statistics
es_es: Estadísticas de pypilot
fi_fi: pypilot tilastot
fr_fr: statistiques de pypilot

source: pypilot Calibration
es_es: Calibración de pypilot
fi_fi: pypilot Kalibrointi
fr_fr: Calibration du pypilot

source: Plots
es_es: Trazados
fi_fi: Plotit
fr_fr: Points

source: Disconnected
es_es: Desconectado
fi_fi: Yhteys katkaistu
fr_fr: Déconnecté

source: Connected
es_es: Conectado
fi_fi: Yhdistetty
fr_fr: Connecté

source: to
es_es: hacia
fr_fr: à

source: host
fi_fi: isäntä
fr_fr: hôte
